In [1]:
pDispatch = pd.read_csv("output/simulations_run_20251129_211522/baseline/output_csv/pDispatch.csv")

NameError: name 'pd' is not defined

In [19]:
import pandas as pd
import numpy as np
pDispatch = pd.read_csv("output/simulations_run_20251129_211522/baseline/output_csv/pDispatch.csv")

In [20]:
pDispatch

                   z     y   q   d      uni    t        value
0       South_Africa  2025  Q1  d1  Imports   t1  1085.022757
1       South_Africa  2025  Q1  d1  Imports   t2   259.373090
2       South_Africa  2025  Q1  d1  Imports   t3   663.321085
3       South_Africa  2025  Q1  d1  Imports   t5   996.948812
4       South_Africa  2025  Q1  d1  Imports   t6  1371.132542
...              ...   ...  ..  ..      ...  ...          ...
138167         Mozal  2035  Q4  d4   Demand  t20  1053.407550
138168         Mozal  2035  Q4  d4   Demand  t21  1053.407550
138169         Mozal  2035  Q4  d4   Demand  t22  1053.407550
138170         Mozal  2035  Q4  d4   Demand  t23  1053.407550
138171         Mozal  2035  Q4  d4   Demand  t24  1058.367457

[138172 rows x 7 columns]

In [21]:
 net_exchange = pDispatch[pDispatch['uni'].isin(["Exports", "Imports"])]

In [22]:
net_exchange

                   z     y   q   d      uni    t        value
0       South_Africa  2025  Q1  d1  Imports   t1  1085.022757
1       South_Africa  2025  Q1  d1  Imports   t2   259.373090
2       South_Africa  2025  Q1  d1  Imports   t3   663.321085
3       South_Africa  2025  Q1  d1  Imports   t5   996.948812
4       South_Africa  2025  Q1  d1  Imports   t6  1371.132542
...              ...   ...  ..  ..      ...  ...          ...
138143         Mozal  2035  Q4  d4  Exports  t17   -58.172169
138144         Mozal  2035  Q4  d4  Exports  t21   -43.292450
138145         Mozal  2035  Q4  d4  Exports  t22   -43.292450
138146         Mozal  2035  Q4  d4  Exports  t23   -43.292450
138147         Mozal  2035  Q4  d4  Exports  t24   -38.332543

[70983 rows x 7 columns]

In [23]:
net_exchange = net_exchange.set_index(['z', 'uni', 'y', 'q', 'd', 't']).squeeze().unstack('uni')

In [24]:
net_exchange.columns.name = None

In [29]:
net_exchange = net_exchange.fillna(0)
net_exchange['value'] = net_exchange['Exports'] + net_exchange['Imports']
net_exchange

                             Exports  Imports        value
z        y    q  d  t
Angola   2030 Q1 d1 t1   -139.105450      0.0  -139.105450
                    t10  -139.105450      0.0  -139.105450
                    t11  -139.105450      0.0  -139.105450
                    t12  -124.053828      0.0  -124.053828
                    t13  -139.105450      0.0  -139.105450
...                              ...      ...          ...
Zimbabwe 2035 Q4 d4 t5  -1292.000000      0.0 -1292.000000
                    t6  -1292.000000      0.0 -1292.000000
                    t7  -1292.000000      0.0 -1292.000000
                    t8  -1292.000000   1513.0   221.000000
                    t9  -1292.000000   1513.0   221.000000

[51825 rows x 3 columns]

In [14]:
net_exchange.reset_index()

              z     y   q   d    t      Exports  Imports  value
0        Angola  2030  Q1  d1   t1  -139.105450      NaN    NaN
1        Angola  2030  Q1  d1  t10  -139.105450      NaN    NaN
2        Angola  2030  Q1  d1  t11  -139.105450      NaN    NaN
3        Angola  2030  Q1  d1  t12  -124.053828      NaN    NaN
4        Angola  2030  Q1  d1  t13  -139.105450      NaN    NaN
...         ...   ...  ..  ..  ...          ...      ...    ...
51820  Zimbabwe  2035  Q4  d4   t5 -1292.000000      NaN    NaN
51821  Zimbabwe  2035  Q4  d4   t6 -1292.000000      NaN    NaN
51822  Zimbabwe  2035  Q4  d4   t7 -1292.000000      NaN    NaN
51823  Zimbabwe  2035  Q4  d4   t8 -1292.000000   1513.0  221.0
51824  Zimbabwe  2035  Q4  d4   t9 -1292.000000   1513.0  221.0

[51825 rows x 8 columns]

In [17]:
net_exchange['attribute'] = 'Net exchange'

In [18]:
net_exchange

                             Exports  Imports  value     attribute
z        y    q  d  t
Angola   2030 Q1 d1 t1   -139.105450      NaN    NaN  Net exchange
                    t10  -139.105450      NaN    NaN  Net exchange
                    t11  -139.105450      NaN    NaN  Net exchange
                    t12  -124.053828      NaN    NaN  Net exchange
                    t13  -139.105450      NaN    NaN  Net exchange
...                              ...      ...    ...           ...
Zimbabwe 2035 Q4 d4 t5  -1292.000000      NaN    NaN  Net exchange
                    t6  -1292.000000      NaN    NaN  Net exchange
                    t7  -1292.000000      NaN    NaN  Net exchange
                    t8  -1292.000000   1513.0  221.0  Net exchange
                    t9  -1292.000000   1513.0  221.0  Net exchange

[51825 rows x 4 columns]